content/man/man1/flatpak-history.1.org
#+TITLE: Manpages - flatpak-history.1
* NAME
flatpak-history - Show history

* SYNOPSIS
*flatpak history* [OPTION...]

* DESCRIPTION
Shows changes to the flatpak installations on the system. This includes
installs, updates and removals of applications and runtimes.

By default, both per-user and system-wide installations are shown. Use
the *--user*, *--installation* or *--system* options to change this.

The information for the history command is taken from the systemd
journal, and can also be accessed using e.g. *journalctl
MESSAGE_ID=c7b39b1e006b464599465e105b361485*

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Show help options and exit.

#+end_quote

*-u*, *--user*

#+begin_quote
Show changes to the user installation.

#+end_quote

*--system*

#+begin_quote
Show changes to the default system-wide installation.

#+end_quote

*--installation=NAME*

#+begin_quote
Show changes to the installation specified by NAME among those defined
in /etc/flatpak/installations.d/. Using *--installation=default* is
equivalent to using *--system*.

#+end_quote

*--since=TIME*

#+begin_quote
Only show changes that are newer than the time specified by TIME.

TIME can be either an absolute time in a format like YYYY-MM-DD
HH:MM:SS, or a relative time like "2h", "7days", "4days 2hours".

#+end_quote

*--until=TIME*

#+begin_quote
Only show changes that are older than the time specified by TIME.

#+end_quote

*--reverse*

#+begin_quote
Show newest entries first.

#+end_quote

*-v*, *--verbose*

#+begin_quote
Print debug information during command processing.

#+end_quote

*--ostree-verbose*

#+begin_quote
Print OSTree debug information during command processing.

#+end_quote

*--columns=FIELD,...*

#+begin_quote
Specify what information to show about each ref. You can list multiple
fields, or use this option multiple times.

Append :s[tart], :m[iddle], :e[nd] or :f[ull] to column names to change
ellipsization.

#+end_quote

* FIELDS
The following fields are understood by the *--columns* option:

time

#+begin_quote
Show when the change happened

#+end_quote

change

#+begin_quote
Show the kind of change

#+end_quote

ref

#+begin_quote
Show the ref

#+end_quote

application

#+begin_quote
Show the application/runtime ID

#+end_quote

arch

#+begin_quote
Show the architecture

#+end_quote

branch

#+begin_quote
Show the branch

#+end_quote

installation

#+begin_quote
Show the affected installation.

This will be either the ID of a Flatpak installation, or the path to a
temporary OSTree repository.

#+end_quote

remote

#+begin_quote
Show the remote that is used.

This will be either the name of a configured remote, or the path to a
temporary OSTree repository.

#+end_quote

old-commit

#+begin_quote
Show the previous commit. For pulls, this is the previous HEAD of the
branch. For deploys, it is the previously active commit

#+end_quote

commit

#+begin_quote
Show the current commit. For pulls, this is the HEAD of the branch. For
deploys, it is the active commit

#+end_quote

url

#+begin_quote
Show the remote url

#+end_quote

user

#+begin_quote
Show the user doing the change.

If this is the system helper operating as root, also show which user
triggered the change.

#+end_quote

tool

#+begin_quote
Show the tool that was used.

If this is the system helper, also show which tool was used to triggered
the change.

#+end_quote

all

#+begin_quote
Show all columns

#+end_quote

help

#+begin_quote
Show the list of available columns

#+end_quote

Note that field names can be abbreviated to a unique prefix.

* SEE ALSO
*flatpak*(1), *journalctl*(1)
