public/man/man1/flatpak-history.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - flatpak-history.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - flatpak-history.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>flatpak-history - Show history</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>flatpak history</strong> [OPTION…]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Shows changes to the flatpak installations on the system. This includes
installs, updates and removals of applications and runtimes.</p>
<p>
By default, both per-user and system-wide installations are shown. Use
the <strong>–user</strong>, <strong>–installation</strong> or <strong>–system</strong> options to change this.</p>
<p>
The information for the history command is taken from the systemd
journal, and can also be accessed using e.g. <strong>journalctl
MESSAGE_ID=c7b39b1e006b464599465e105b361485</strong></p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Show help options and exit.</p>
</blockquote>
<p>
<strong>-u</strong>, <strong>–user</strong></p>
<blockquote>
<p>Show changes to the user installation.</p>
</blockquote>
<p>
<strong>–system</strong></p>
<blockquote>
<p>Show changes to the default system-wide installation.</p>
</blockquote>
<p>
<strong>–installation=NAME</strong></p>
<blockquote>
<p>Show changes to the installation specified by NAME among those defined
in <em>etc/flatpak/installations.d</em>. Using <strong>–installation=default</strong> is
equivalent to using <strong>–system</strong>.</p>
</blockquote>
<p>
<strong>–since=TIME</strong></p>
<blockquote>
<p>Only show changes that are newer than the time specified by TIME.</p>
<p>
TIME can be either an absolute time in a format like YYYY-MM-DD
HH:MM:SS, or a relative time like &#34;2h&#34;, &#34;7days&#34;, &#34;4days 2hours&#34;.</p>
</blockquote>
<p>
<strong>–until=TIME</strong></p>
<blockquote>
<p>Only show changes that are older than the time specified by TIME.</p>
</blockquote>
<p>
<strong>–reverse</strong></p>
<blockquote>
<p>Show newest entries first.</p>
</blockquote>
<p>
<strong>-v</strong>, <strong>–verbose</strong></p>
<blockquote>
<p>Print debug information during command processing.</p>
</blockquote>
<p>
<strong>–ostree-verbose</strong></p>
<blockquote>
<p>Print OSTree debug information during command processing.</p>
</blockquote>
<p>
<strong>–columns=FIELD,…</strong></p>
<blockquote>
<p>Specify what information to show about each ref. You can list multiple
fields, or use this option multiple times.</p>
<p>
Append :s[tart], :m[iddle], :e[nd] or :f[ull] to column names to change
ellipsization.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FIELDS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The following fields are understood by the <strong>–columns</strong> option:</p>
<p>
time</p>
<blockquote>
<p>Show when the change happened</p>
</blockquote>
<p>
change</p>
<blockquote>
<p>Show the kind of change</p>
</blockquote>
<p>
ref</p>
<blockquote>
<p>Show the ref</p>
</blockquote>
<p>
application</p>
<blockquote>
<p>Show the application/runtime ID</p>
</blockquote>
<p>
arch</p>
<blockquote>
<p>Show the architecture</p>
</blockquote>
<p>
branch</p>
<blockquote>
<p>Show the branch</p>
</blockquote>
<p>
installation</p>
<blockquote>
<p>Show the affected installation.</p>
<p>
This will be either the ID of a Flatpak installation, or the path to a
temporary OSTree repository.</p>
</blockquote>
<p>
remote</p>
<blockquote>
<p>Show the remote that is used.</p>
<p>
This will be either the name of a configured remote, or the path to a
temporary OSTree repository.</p>
</blockquote>
<p>
old-commit</p>
<blockquote>
<p>Show the previous commit. For pulls, this is the previous HEAD of the
branch. For deploys, it is the previously active commit</p>
</blockquote>
<p>
commit</p>
<blockquote>
<p>Show the current commit. For pulls, this is the HEAD of the branch. For
deploys, it is the active commit</p>
</blockquote>
<p>
url</p>
<blockquote>
<p>Show the remote url</p>
</blockquote>
<p>
user</p>
<blockquote>
<p>Show the user doing the change.</p>
<p>
If this is the system helper operating as root, also show which user
triggered the change.</p>
</blockquote>
<p>
tool</p>
<blockquote>
<p>Show the tool that was used.</p>
<p>
If this is the system helper, also show which tool was used to triggered
the change.</p>
</blockquote>
<p>
all</p>
<blockquote>
<p>Show all columns</p>
</blockquote>
<p>
help</p>
<blockquote>
<p>Show the list of available columns</p>
</blockquote>
<p>
Note that field names can be abbreviated to a unique prefix.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*flatpak*(1), *journalctl*(1)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
